vault/v87/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

// k-Omega SST
// internalField   uniform 0;

// Spalart-Allmaras
internalField   uniform 0.14;

boundaryField
{
    // k-Omega SST
    "(inlet|outlet|tunnel)"
    {
        type            calculated;
        value           uniform 0;
    }
    wing
    {
        type            fixedValue;
        value           uniform 0;
    }

    // Spalart-Allmaras
    // "(inlet|outlet)"
    // {
    //     type            freestream;
    //     freestreamValue $internalField;
    // }
    // "(wing|tunnel)"
    // {
    //     type            fixedValue;
    //     value           uniform 0;
    // }
	
    front_and_back
    {
	    type       		empty;
    }

}


// ************************************************************************* //
